library/Shineisp/Banks/BNL/Igfs/IgfsCgVoidAuth.request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.api.web.cg.igfs.apps.netsw.it/">
<soapenv:Header/>
<soapenv:Body>
<ser:VoidAuth>
<request>
<apiVersion><![CDATA[{apiVersion}]]></apiVersion>
<tid><![CDATA[{tid}]]></tid>
<signature><![CDATA[{signature}]]></signature>
<shopID><![CDATA[{shopID}]]></shopID>
<amount><![CDATA[{amount}]]></amount>
<refTranID><![CDATA[{refTranID}]]></refTranID>
</request>
</ser:VoidAuth>
</soapenv:Body>
</soapenv:Envelope>
