src/IGFS_CG_API/mpi/IgfsCgMpiAuth.request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.api.web.cg.igfs.apps.netsw.it/">
<soapenv:Body>
<ser:Auth>
<request>
<apiVersion><![CDATA[{apiVersion}]]></apiVersion>
<tid><![CDATA[{tid}]]></tid>
<signature><![CDATA[{signature}]]></signature>
<shopID><![CDATA[{shopID}]]></shopID>
<paRes><![CDATA[{paRes}]]></paRes>
<md><![CDATA[{md}]]></md>
</request>
</ser:Auth>
</soapenv:Body>
</soapenv:Envelope>
